using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Увольнения.Source
{
    static class DataMan
    {
        static private ObservableCollection<DataManSub> thatData;

        internal static ObservableCollection<DataManSub> ThatData { get => thatData; set => thatData = value; }

        //*///------------------------------------------------------------------------------------------
        //*///------------------------------------------------------------------------------------------
        //*///------------------------------------------------------------------------------------------
        //*///------------------------------------------------------------------------------------------
        static public void Init()
        {
            ThatData = new ObservableCollection<DataManSub>();
        }
        //*///------------------------------------------------------------------------------------------
        //*///------------------------------------------------------------------------------------------
        static public void SetData(List<List<object>> data_)
        {
            foreach(var i in data_)
            {
                DataManSub man = new DataManSub(Int32.Parse(i[0].ToString()), i[1].ToString(), Int32.Parse(i[2].ToString()), Int32.Parse(i[2].ToString()));
                ThatData.Add(man);
            }
        }
    }
    //*///------------------------------------------------------------------------------------------
    //*///------------------------------------------------------------------------------------------
    //*///------------------------------------------------------------------------------------------
    //*///------------------------------------------------------------------------------------------
    //*///------------------------------------------------------------------------------------------
    //*///------------------------------------------------------------------------------------------
    //*///------------------------------------------------------------------------------------------
    //*///------------------------------------------------------------------------------------------
    class DataManSub
    {
        private int thatID;
        private int thatManID;
        private int thatPlatoon;
        private string thatName;
        
        public int ThatID { get => thatID; set => thatID = value; }
        public int ThatManID { get => thatManID; set => thatManID = value; }
        public int ThatPlatoon { get => thatPlatoon; set => thatPlatoon = value; }
        public string ThatName { get => thatName; set => thatName = value; }
        //*///------------------------------------------------------------------------------------------
        //*///------------------------------------------------------------------------------------------
        //*///------------------------------------------------------------------------------------------
        //*///------------------------------------------------------------------------------------------
        public DataManSub(int id_, string name_, int manid_, int platoon_)
        {
            ThatID = id_;
            ThatManID = manid_;
            ThatPlatoon = platoon_;
            ThatName = name_;
        }
        //*///------------------------------------------------------------------------------------------
        //*///------------------------------------------------------------------------------------------
    }
}
